src/src/Enums/OperationTypesCashReceipt.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>OperationTypesCashReceipt</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>FromCustomer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FromVendor</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FromAdvanceHolder</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RetailIncome</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RetailIncomeEarningAccounting</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CurrencyPurchase</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Other</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherSettlements</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LoanSettlements</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LoanRepaymentByEmployee</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/src/Enums/OperationTypesPaymentReceipt.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>OperationTypesPaymentReceipt</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>FromCustomer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FromVendor</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FromAdvanceHolder</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CurrencyPurchase</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Other</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Taxes</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherSettlements</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LoanSettlements</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LoanRepaymentByEmployee</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/src/Enums/VariantsOfProvidingEPD.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>VariantsOfProvidingEPD</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>PaymentDocument</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PaymentDocumentWithVATAdjustment</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CreditDebitNote</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CreditDebitNoteWithVATAdjustment</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/src/Enums/OperationTypesCashVoucher.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>OperationTypesCashVoucher</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Salary</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SalaryForEmployee</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Taxes</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ToAdvanceHolder</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ToCustomer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Vendor</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Other</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TransferToCashCR</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherSettlements</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LoanSettlements</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IssueLoanToEmployee</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/src/Enums/OperationTypesPaymentExpense.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>OperationTypesPaymentExpense</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Vendor</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ToCustomer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ToAdvanceHolder</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Salary</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Other</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Taxes</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherSettlements</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LoanSettlements</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IssueLoanToEmployee</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/src/Catalogs/CounterpartyContracts.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>CounterpartyContracts</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Counterparties</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>SettlementsCurrency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ContractDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SettlementsInStandardUnits</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ContractNo</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ContractKind</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ContractType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PriceKind</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PriceTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SupplierPriceTypes</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.SupplierPriceTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DiscountMarkupKind</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DiscountTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ContractForm</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ContractForms</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BusinessLine</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LinesOfBusiness</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CashFlowItem</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CashFlowItems</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ContactPerson</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ContactPersons</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ContractType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CounterpartyContractTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CounterpartyBankAccount</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BankAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Department</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BusinessUnits</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Responsible</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Status</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CounterpartyContractStatuses</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ValidityStartDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ValidityEndDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PaymentMethod</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CashAssetTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ProvideEPD</Name>
					<Type>
						<v8:Type>cfg:EnumRef.VariantsOfProvidingEPD</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalAttributesAndInformation</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TextString</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>EditableParameters</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>FormRefs</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ContractForms</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Presentation</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>InfobaseParameters</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>FormRefs</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ContractForms</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Presentation</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Parameter</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</v8:Type>
								<v8:Type>cfg:EnumRef.ContractsWithCounterpartiesTemplatesParameters</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>StagesOfPayment</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Term</Name>
							<Type>
								<v8:Type>cfg:EnumRef.PaymentTerm</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DuePeriod</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PaymentPercentage</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>EarlyPaymentDiscounts</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Period</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Discount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/src/CommonModules/EarlyPaymentDiscountsServer/Ext/Module.bsl
#Region Public

// Checks for correctness of the early payments discounts
//  Parameters:
//   TabularSectionEPD - FormDataCollection - tabular section with EPD from Contract,
//                                            Sales invoice or Supplier invoice
//  Returns:
//   boolean - EPD correct or not
//
Function CheckEarlyPaymentDiscounts(TabularSectionEPD, ProvideEPD) Export
	
	Result = True;
	
	Query = New Query;
	Query.Text =
	"SELECT
	|	EarlyPaymentDiscounts.Period AS Period,
	|	EarlyPaymentDiscounts.Discount AS Discount
	|INTO TempEarlyPaymentDiscounts
	|FROM
	|	&EarlyPaymentDiscounts AS EarlyPaymentDiscounts
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	Table.Period AS Period,
	|	Table.Discount AS Discount
	|FROM
	|	TempEarlyPaymentDiscounts AS Table
	|
	|ORDER BY
	|	Period";
	
	Query.SetParameter("EarlyPaymentDiscounts", TabularSectionEPD.Unload());
	
	DataSelection = Query.Execute().Select();
	
	PreviousDiscount = 100;
	PreviousPeriod = 0;
	
	If TabularSectionEPD.Count() > 0 AND NOT ValueIsFilled(ProvideEPD) Then
		
		CommonUseClientServer.MessageToUser(NStr("en = 'Select a EPD provision option'"));
		
		Result = False;
		
	EndIf;
	
	While DataSelection.Next() Do
		
		If DataSelection.Discount = 0 OR DataSelection.Discount >= 100 Then
			
			TextMessage = StringFunctionsClientServer.SubstituteParametersInString(
				NStr("en = 'The early payment discount can''t be %1%'"),
				DataSelection.Discount);
			
			CommonUseClientServer.MessageToUser(TextMessage);
			
			Result = False;
			
		ElsIf PreviousDiscount <= DataSelection.Discount Then
			
			TextError = NStr("en = 'The early payment discount %1% with the period %2 days should be less then the discount %3% with the period %4 days'");
			
			TextMessage = StringFunctionsClientServer.SubstituteParametersInString(
				TextError,
				DataSelection.Discount,
				DataSelection.Period,
				PreviousDiscount,
				PreviousPeriod);
			
			CommonUseClientServer.MessageToUser(TextMessage);
			
			Result = False;
			
		EndIf;
		
		PreviousDiscount = DataSelection.Discount;
		PreviousPeriod = DataSelection.Period;
		
	EndDo;
	
	Return Result;
	
EndFunction

// Sets hyperlink label for credit note
//
Procedure SetTextAboutCreditNote(DocumentForm, BasisDocument) Export
	
	CreditNoteFound = GetSubordinateCreditNote(BasisDocument);
	
	If ValueIsFilled(CreditNoteFound) Then
		DocumentForm.CreditNoteText = EarlyPaymentDiscountsClientServer.CreditNotePresentation(CreditNoteFound.Date, CreditNoteFound.Number);
	Else
		DocumentForm.CreditNoteText = NStr("en = 'In order to provide EPD, please issue the Credit note'");
	EndIf;
	
EndProcedure

// Returns reference to the subordinate credit note
//
Function GetSubordinateCreditNote(BasisDocument) Export
	
	If NOT ValueIsFilled(BasisDocument) Then
		Return Undefined;
	EndIf;
	
	Query = New Query;
	Query.Text = 
	"SELECT
	|	CreditNote.Ref AS Ref
	|FROM
	|	Document.CreditNote AS CreditNote
	|WHERE
	|	CreditNote.BasisDocument = &BasisDocument
	|	AND NOT CreditNote.DeletionMark";
	
	Query.SetParameter("BasisDocument", BasisDocument);
	
	Result = Undefined;
	
	Selection = Query.Execute().Select();
	
	If Selection.Next() Then
		Result = Selection.Ref;
	EndIf;
	
	Return Result;
	
EndFunction

// Gets errors when filling in a credit note
//
Function CheckBeforeCreditNoteFilling(Documents, FindCreditNote = True) Export
	
	Query = New Query;
	Query.Text = 
	"SELECT DISTINCT
	|	CreditNote.BasisDocument AS Recorder,
	|	TRUE AS ThereAreCreditNote,
	|	FALSE AS IncorrectOperation
	|FROM
	|	Document.CreditNote AS CreditNote
	|WHERE
	|	CreditNote.BasisDocument IN(&Documents)
	|	AND NOT CreditNote.DeletionMark
	|	AND &FindCreditNote
	|
	|UNION ALL
	|
	|SELECT TOP 1
	|	CashReceipt.Ref,
	|	FALSE,
	|	CASE
	|		WHEN CashReceipt.OperationKind <> VALUE(Enum.OperationTypesCashReceipt.FromCustomer)
	|			THEN TRUE
	|		ELSE FALSE
	|	END
	|FROM
	|	Document.CashReceipt AS CashReceipt
	|WHERE
	|	CashReceipt.Ref IN(&Documents)
	|
	|UNION ALL
	|
	|SELECT TOP 1
	|	PaymentReceipt.Ref,
	|	FALSE,
	|	CASE
	|		WHEN PaymentReceipt.OperationKind <> VALUE(Enum.OperationTypesPaymentReceipt.FromCustomer)
	|			THEN TRUE
	|		ELSE FALSE
	|	END
	|FROM
	|	Document.PaymentReceipt AS PaymentReceipt
	|WHERE
	|	PaymentReceipt.Ref IN(&Documents)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT DISTINCT
	|	CashReceiptPaymentDetails.Contract AS Contract
	|FROM
	|	Document.CashReceipt.PaymentDetails AS CashReceiptPaymentDetails
	|		INNER JOIN Document.SalesInvoice AS SalesInvoice
	|		ON CashReceiptPaymentDetails.Document = SalesInvoice.Ref
	|WHERE
	|	CashReceiptPaymentDetails.SettlementsEPDAmount > 0
	|	AND (SalesInvoice.ProvideEPD = VALUE(Enum.VariantsOfProvidingEPD.CreditDebitNote)
	|			OR SalesInvoice.ProvideEPD = VALUE(Enum.VariantsOfProvidingEPD.CreditDebitNoteWithVATAdjustment))
	|	AND CashReceiptPaymentDetails.Contract <> VALUE(Catalog.CounterpartyContracts.EmptyRef)
	|	AND CashReceiptPaymentDetails.Ref IN(&Documents)
	|
	|UNION ALL
	|
	|SELECT DISTINCT
	|	PaymentReceiptPaymentDetails.Contract
	|FROM
	|	Document.PaymentReceipt.PaymentDetails AS PaymentReceiptPaymentDetails
	|		INNER JOIN Document.SalesInvoice AS SalesInvoice
	|		ON PaymentReceiptPaymentDetails.Document = SalesInvoice.Ref
	|WHERE
	|	PaymentReceiptPaymentDetails.SettlementsEPDAmount > 0
	|	AND (SalesInvoice.ProvideEPD = VALUE(Enum.VariantsOfProvidingEPD.CreditDebitNote)
	|			OR SalesInvoice.ProvideEPD = VALUE(Enum.VariantsOfProvidingEPD.CreditDebitNoteWithVATAdjustment))
	|	AND PaymentReceiptPaymentDetails.Contract <> VALUE(Catalog.CounterpartyContracts.EmptyRef)
	|	AND PaymentReceiptPaymentDetails.Ref IN(&Documents)";
	
	Query.SetParameter("Documents", Documents);
	Query.SetParameter("FindCreditNote", FindCreditNote);
	
	Cancel = False;
	Errors = Undefined;
	
	ResultArray = Query.ExecuteBatch();
	
	Selection = ResultArray[0].Select();
	
	TextCreditNoteError = NStr("en = 'There is already a credit note based on %1.'");
	
	IncorrectOperation = NStr("en = 'The Credit note is entered only when paying from the Customer.'");
	
	While Selection.Next() Do
		
		If Selection.ThereAreCreditNote Then
			ErrorText = StringFunctionsClientServer.SubstituteParametersInString(TextCreditNoteError, Selection.Recorder);
			CommonUseClientServer.AddUserError(Errors, , ErrorText, Undefined);
		EndIf;
		
		If Selection.IncorrectOperation Then
			CommonUseClientServer.AddUserError(Errors, , IncorrectOperation, Undefined);
		EndIf;
		
	EndDo;
	
	SelectionTable = ResultArray[1].Unload();
	
	TextEPDError = NStr("en = 'There are no rows with early payment discount in the Payment allocation, witch provide via credit note.'");
	
	If SelectionTable.Count() = 0 Then
		
		CommonUseClientServer.AddUserError(Errors, , TextEPDError, Undefined);
		
	EndIf;
	
	TextContractError = NStr("en = 'To generate Credit note, the payment allocation rows should contain the same contract.'");
	
	If SelectionTable.Count() > 1 Then
		
		CommonUseClientServer.AddUserError(Errors, , TextContractError, Undefined);
		
	EndIf;
	
	CommonUseClientServer.ShowErrorsToUser(Errors, Cancel);
	
	Return Cancel;
	
EndFunction

// Sets hyperlink label for debit note
//
Procedure SetTextAboutDebitNote(DocumentForm, BasisDocument) Export
	
	DebitNoteFound = GetSubordinateDebitNote(BasisDocument);
	
	If ValueIsFilled(DebitNoteFound) Then
		DocumentForm.DebitNoteText = EarlyPaymentDiscountsClientServer.DebitNotePresentation(DebitNoteFound.Date, DebitNoteFound.Number);
	Else
		DocumentForm.DebitNoteText = NStr("en = 'In order to provide EPD, please issue the Debit note'");
	EndIf;
	
EndProcedure

// Returns reference to the subordinate credit note
//
Function GetSubordinateDebitNote(BasisDocument) Export
	
	If NOT ValueIsFilled(BasisDocument) Then
		Return Undefined;
	EndIf;
	
	Query = New Query;
	Query.Text = 
	"SELECT
	|	DebitNote.Ref AS Ref
	|FROM
	|	Document.DebitNote AS DebitNote
	|WHERE
	|	DebitNote.BasisDocument = &BasisDocument
	|	AND NOT DebitNote.DeletionMark";
	
	Query.SetParameter("BasisDocument", BasisDocument);
	
	Result = Undefined;
	
	Selection = Query.Execute().Select();
	
	If Selection.Next() Then
		Result = Selection.Ref;
	EndIf;
	
	Return Result;
	
EndFunction

// Gets errors when filling in a credit note
//
Function CheckBeforeDebitNoteFilling(Documents, FindDebitNote = True) Export
	
	Query = New Query;
	Query.Text = 
	"SELECT DISTINCT
	|	DebitNote.BasisDocument AS Recorder,
	|	TRUE AS ThereAreDebitNote,
	|	FALSE AS IncorrectOperation
	|FROM
	|	Document.DebitNote AS DebitNote
	|WHERE
	|	DebitNote.BasisDocument IN(&Documents)
	|	AND NOT DebitNote.DeletionMark
	|	AND &FindDebitNote
	|
	|UNION ALL
	|
	|SELECT TOP 1
	|	CashVoucher.Ref,
	|	FALSE,
	|	CASE
	|		WHEN CashVoucher.OperationKind <> VALUE(Enum.OperationTypesCashVoucher.Vendor)
	|			THEN TRUE
	|		ELSE FALSE
	|	END
	|FROM
	|	Document.CashVoucher AS CashVoucher
	|WHERE
	|	CashVoucher.Ref IN(&Documents)
	|
	|UNION ALL
	|
	|SELECT TOP 1
	|	PaymentExpense.Ref,
	|	FALSE,
	|	CASE
	|		WHEN PaymentExpense.OperationKind <> VALUE(Enum.OperationTypesPaymentExpense.Vendor)
	|			THEN TRUE
	|		ELSE FALSE
	|	END
	|FROM
	|	Document.PaymentExpense AS PaymentExpense
	|WHERE
	|	PaymentExpense.Ref IN(&Documents)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT DISTINCT
	|	CashVoucherPaymentDetails.Contract AS Contract
	|FROM
	|	Document.CashVoucher.PaymentDetails AS CashVoucherPaymentDetails
	|		INNER JOIN Document.SupplierInvoice AS SupplierInvoice
	|		ON CashVoucherPaymentDetails.Document = SupplierInvoice.Ref
	|WHERE
	|	CashVoucherPaymentDetails.SettlementsEPDAmount > 0
	|	AND (SupplierInvoice.ProvideEPD = VALUE(Enum.VariantsOfProvidingEPD.CreditDebitNote)
	|			OR SupplierInvoice.ProvideEPD = VALUE(Enum.VariantsOfProvidingEPD.CreditDebitNoteWithVATAdjustment))
	|	AND CashVoucherPaymentDetails.Contract <> VALUE(Catalog.CounterpartyContracts.EmptyRef)
	|	AND CashVoucherPaymentDetails.Ref IN(&Documents)
	|
	|UNION ALL
	|
	|SELECT DISTINCT
	|	PaymentExpensePaymentDetails.Contract
	|FROM
	|	Document.PaymentExpense.PaymentDetails AS PaymentExpensePaymentDetails
	|		INNER JOIN Document.SupplierInvoice AS SupplierInvoice
	|		ON PaymentExpensePaymentDetails.Document = SupplierInvoice.Ref
	|WHERE
	|	PaymentExpensePaymentDetails.SettlementsEPDAmount > 0
	|	AND (SupplierInvoice.ProvideEPD = VALUE(Enum.VariantsOfProvidingEPD.CreditDebitNote)
	|			OR SupplierInvoice.ProvideEPD = VALUE(Enum.VariantsOfProvidingEPD.CreditDebitNoteWithVATAdjustment))
	|	AND PaymentExpensePaymentDetails.Contract <> VALUE(Catalog.CounterpartyContracts.EmptyRef)
	|	AND PaymentExpensePaymentDetails.Ref IN(&Documents)";
	
	Query.SetParameter("Documents", Documents);
	Query.SetParameter("FindDebitNote", FindDebitNote);
	
	Cancel = False;
	Errors = Undefined;
	
	ResultArray = Query.ExecuteBatch();
	
	Selection = ResultArray[0].Select();
	
	TextDebitNoteError = NStr("en = 'There is already a debit note based on %1.'");
	
	IncorrectOperation = NStr("en = 'The Debit note is entered only when paying to the Vendor.'");
	
	While Selection.Next() Do
		
		If Selection.ThereAreDebitNote Then
			ErrorText = StringFunctionsClientServer.SubstituteParametersInString(TextDebitNoteError, Selection.Recorder);
			CommonUseClientServer.AddUserError(Errors, , ErrorText, Undefined);
		EndIf;
		
		If Selection.IncorrectOperation Then
			CommonUseClientServer.AddUserError(Errors, , IncorrectOperation, Undefined);
		EndIf;
		
	EndDo;
	
	SelectionTable = ResultArray[1].Unload();
	
	TextEPDError = NStr("en = 'There are no rows with early payment discount in the Payment allocation, witch provide via debit note.'");
	
	If SelectionTable.Count() = 0 Then
		
		CommonUseClientServer.AddUserError(Errors, , TextEPDError, Undefined);
		
	EndIf;
	
	TextContractError = NStr("en = 'To generate Debit note, the payment allocation rows should contain the same contract.'");
	
	If SelectionTable.Count() > 1 Then
		
		CommonUseClientServer.AddUserError(Errors, , TextContractError, Undefined);
		
	EndIf;
	
	CommonUseClientServer.ShowErrorsToUser(Errors, Cancel);
	
	Return Cancel;
	
EndFunction

#EndRegion
